[
  {
    "date": "February 2022",
    "title": "Creating Dev Log Page",
    "text": "This months has been pretty interesting. I have learned several things like how to use Gatsby and GraphQL. I have been working on auto-clock-speed a lot, and I 0.1.8 was released! I have also been writing code for the Hermes project. This months I picked up the book 'Design Patterns' and it's great. Something that I have been using more often is React. Sometimes I forget how useful a good frontend framework can be. On an unrelated note, I have been learning more about computer science theory and software development history. Knowing what others did in the past is helpful when making decision.",
    "links": []
  },

  {
    "date": "March 2022",
    "title": "Starting Local List",
    "text": "This month, I registered the domains finditlocal.org and finditlocal.us for a company called Local List I started in connection with my Econ class. I created a frontend using React and a backend using Django. Currently, both are hosted and communicating to display local products at those domains. I am really excited for this project and I even printed business cards and stickers for the project to share with classmates. I feel like this project is the latest culmination of my skills in frontend, backend, and system architecture. The part I am most proud of is the architecture and design decisions to allow for further development and higher traffic as the project grows. I also worked more on my yet to be released (as of March 31st 2022) runtime-analysis-paper, including a new idea I thought of regarding error handling.",
    "links": ["http://finditlocal.org"]
  },

  {
    "date": "April 2022",
    "title": "Local List Business Pitch",
    "text": "On April 21st, the whole Local List team (Me and 4 others) got to present our business to our town's chamber of commerce. Our idea and demo was met with lots of excitement and great feedback. The day after, we got to pitch our idea to more business owners during our school's business project's night event. We won the event's Judges award for our idea and presentation. The current site can be found at thelocallist.org. Our judges invited us to a city event where we will have a booth and present to the public. This month, I also made two projects (derive, and integrate) in C that implement ideas from calculus. I also started using Svelte for a mindfulness tracker app that I might publish in a few weeks.",
    "links": [
      "http://thelocallist.org",
      "https://github.com/JakeRoggenbuck/derive",
      "https://github.com/JakeRoggenbuck/integrate"
    ]
  },

  {
    "date": "May 2022",
    "title": "Da Vinci Game Jam - More Auto Clock Speed",
    "text": "This month I had my finals and AP tests, all of which where a lot of work, but I still worked on some project and organized the first annual Da Vinci Game Jam for my school. Links to the resources for the workshops can be found at the first link below. The game jam was an overall success and we had many great game entries. This month I also worked on auto clock speed some more, adding a universal interface to all of the commands and other issues. I created a total of 44 commits on that project this month. Github summarizes this month with 'Created 238 commits in 26 repositories', I also created 13 repositories this month, two for the game jam, one related to a possible future auto-clock-speed side project, two about my statistics class, two about my link shortener project, two related to JABACAT (Group of programmers), and one as a tool to help view csv files that I might release sometime next month.",
    "links": [
      "https://jr0.org/event/dv-game-jam-2022/",
      "https://github.com/JakeRoggenbuck/auto-clock-speed"
    ]
  },

  {
    "date": "June 2022",
    "title": "Go, C, and Rust!",
    "text": "This month I have committed to keeping up three system languages (Go, Rust, C) to learn more about backend tools and system programs. I also keep up my skills with Python because it is a great language to know. I made a library called Sense and wrote it in Go, Rust, C, and Python. I also wrote a preprocesor for Go in Go, first link. I also wrote a study tool called study-cli in Go as well. I also continued to work on auto-clock-speed, with 1.0 on its way.",
    "links": [
      "https://github.com/JakeRoggenbuck/sense-rust",
      "https://github.com/JakeRoggenbuck/macaroon",
      "https://github.com/JakeRoggenbuck/study-cli",
      "https://github.com/JakeRoggenbuck/auto-clock-speed"
    ]
  }
]
